# 1. Напишите программу, удаляющую из текста все слова, содержащие "абв".


# f = open('text_for_5.1.txt', encoding='UTF-8')
# file = f.read()
# f.close()

# delete_word = 'абв'
# split_file = file.split()

# filtered_str = ' '.join(list(filter(lambda word: delete_word not in word, split_file)))

# print(file)
# print(filtered_str)





# 2. Создайте программу для игры с конфетами человек против человека.

# Условие задачи: На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга. 
# Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет. Все 
# конфеты оппонента достаются сделавшему последний ход. Сколько конфет нужно взять первому игроку, 
# чтобы забрать все конфеты у своего конкурента?

# a) Добавьте игру против бота

# b) Подумайте как наделить бота ""интеллектом""







# Создайте программу для игры в ""Крестики-нолики"".

# Реализуйте RLE алгоритм: реализуйте модуль сжатия и восстановления данных.

# Входные и выходные данные хранятся в отдельных текстовых файлах.